# St7SetNFAModeParticipationCalculate

Sets the state of the mass participation option for natural frequency analysis.

long St7SetNFAModeParticipationCalculate(long uID, bool Calculate)
Input Parameters
uID
Strand7 model file ID.
Calculate
True to calculate the mass participation for each mode in the analysis.